
//0:专业名称 1：父级id 2：专业id 3:是否为热门专业
var jobArray = [
["设计/IT/电脑应用", "0", "100000", 0],
["设计", "100000", "101000", 0],
["平面设计", "101000", "101010", 1],
["广告设计", "101000", "101011", 0],
["网页设计", "101000", "101012", 1],
["游戏设计", "101000", "101013", 0],
["动漫设计", "101000", "101014", 0],
["影视设计", "101000", "101015", 0],
["动画设计", "101000", "101016", 0],
["室内设计", "101000", "101017", 0],
["景观设计", "101000", "101018", 0],
["建筑设计", "101000", "101019", 0],
["陈列设计", "101000", "101020", 0],
["产品设计", "101000", "101021", 0],
["珠宝设计", "101000", "101022", 0],
["模具设计", "101000", "101023", 0],
["鞋样设计", "101000", "101024", 0],
["程序开发", "100000", "101100", 0],
["IOS", "101100", "101110", 0],
["Android", "101100", "101111", 0],
["JAVA", "101100", "101112", 0],
["C/C++", "101100", "101113", 0],
["PHP", "101100", "101114", 0],
["ASP", "101100", "101115", 0],
["C#", "101100", "101116", 0],
["Delphi", "101100", "101117", 0],
["Oracle", "101100", "101118", 0],
["软件开发", "101100", "101119", 0],
["数据库", "101100", "101120", 0],
["手机开发", "101100", "101121", 0],
["信息安全工程师", "101100", "101122", 0],
["系统需求分析师", "101100", "101123", 0],
["网络工程师", "101100", "101124", 0],
["嵌入式", "101100", "101125", 0],
["电脑应用", "100000", "101200", 0],
["办公应用", "101200", "101210", 0],
["电脑基础", "101200", "101211", 0],
["电子商务", "101200", "101212", 1],
["速录", "101200", "101213", 0],
["软件测试", "101200", "101214", 0],
["网络技术", "101200", "101215", 0],
["金融/工程建筑/贸易", "0", "110000", 0],
["财会金融", "110000", "111000", 0],
["会计电算化", "111000", "111010", 0],
["会计实务", "111000", "111011", 0],
["特许公认会计师ACCA", "111000", "111012", 0],
["国际注册会计师", "111000", "111013", 0],
["注册会计师", "111000", "111014", 0],
["注册税务师", "111000", "111015", 0],
["资产评估师", "111000", "111016", 0],
["鉴定估价师", "111000", "111017", 0],
["特许金融分析师CFA", "111000", "111018", 0],
["理财规划师", "111000", "111019", 0],
["银行从业", "111000", "111020", 1],
["基金从业", "111000", "111021", 0],
["证券从业", "111000", "111022", 0],
["证券经纪人", "111000", "111023", 0],
["期货从业", "111000", "111024", 0],
["保险从业", "111000", "111025", 1],
["经济师", "111000", "111026", 0],
["精算师", "111000", "111027", 0],
["审计师", "111000", "111028", 0],
["统计师", "111000", "111029", 0],
["工程/建筑类", "110000", "111100", 0],
["建筑五大员", "111100", "111110", 0],
["建造师", "111100", "111111", 1],
["造价工程师", "111100", "111112", 0],
["监理工程师", "111100", "111113", 0],
["安全工程师", "111100", "111114", 0],
["咨询工程师", "111100", "111115", 0],
["结构工程师", "111100", "111116", 0],
["岩土工程师", "111100", "111117", 0],
["房地产估价师", "111100", "111118", 0],
["土地估价师", "111100", "111119", 0],
["房地产经纪人", "111100", "111120", 1],
["房地产策划师", "111100", "111121", 0],
["注册测绘师", "111100", "111122", 0],
["注册计量师", "111100", "111123", 0],
["弱电工师", "111100", "111124", 0],
["造价员", "111100", "111125", 0],
["预算员", "111100", "111126", 0],
["招标师", "111100", "111127", 0],
["城市规划师", "111100", "111128", 0],
["管理/贸易类", "110000", "111200", 0],
["人力资源师", "111200", "111210", 0],
["项目管理师", "111200", "111211", 0],
["酒店管理师", "111200", "111212", 0],
["工商管理师", "111200", "111213", 0],
["物流师", "111200", "111214", 0],
["电子商务师", "111200", "111215", 0],
["营销师", "111200", "111216", 0],
["策划师", "111200", "111217", 0],
["采购师", "111200", "111218", 0],
["企业培训师", "111200", "111219", 0],
["报关员", "111200", "111220", 0],
["跟单员", "111200", "111221", 0],
["货代员", "111200", "111222", 0],
["报检员", "111200", "111223", 0],
["内审员", "111200", "111224", 0],
["外审员", "111200", "111225", 0],
["单证员", "111200", "111226", 0],
["外销员", "111200", "111227", 0],
["物业管理", "111200", "111228", 1],
["客户关系管理", "111200", "111229", 0],
["食品安全管理", "111200", "111230", 0],
["信用管理", "111200", "111231", 0],
["会展管理", "111200", "111232", 0],
["职业经理人", "111200", "111233", 0],
["职业指导师", "111200", "111234", 0],
["外语/行业英语/小语种", "0", "120000", 0],
["外语翻译", "120000", "121000", 0],
["英语笔译", "121000", "121010", 0],
["英语翻译", "121000", "121011", 0],
["英语口译", "121000", "121012", 0],
["同声传译", "121000", "121013", 0],
["行业英语", "120000", "121100", 0],
["商务英语(BEC)", "121100", "121110", 0],
["外贸英语", "121100", "121111", 0],
["服装英语", "121100", "121112", 0],
["旅游英语", "121100", "121113", 0],
["面试英语", "121100", "121114", 0],
["金融英语", "121100", "121115", 0],
["影视英语", "121100", "121116", 0],
["酒店英语", "121100", "121117", 0],
["小语种", "120000", "121200", 0],
["日语", "121200", "121210", 0],
["德语", "121200", "121211", 0],
["法语", "121200", "121212", 0],
["阿拉伯语", "121200", "121213", 0],
["越南语", "121200", "121214", 0],
["葡萄牙语", "121200", "121215", 0],
["匈牙利语", "121200", "121216", 0],
["波兰语", "121200", "121217", 0],
["荷兰语", "121200", "121218", 0],
["意大利语", "121200", "121219", 0],
["西班牙语", "121200", "121220", 0],
["瑞典语", "121200", "121221", 0],
["波斯语", "121200", "121222", 0],
["韩语", "121200", "121223", 0],
["俄语", "121200", "121224", 0],
["印尼语", "121200", "121225", 0],
["印度语", "121200", "121226", 0],
["缅甸语", "121200", "121227", 0],
["土耳其语", "121200", "121228", 0],
["泰语", "121200", "121229", 0],
["马来西亚语", "121200", "121230", 0],
["对外汉语", "121200", "121231", 0],
["企业管理", "0", "130000", 0],
["企业管理", "130000", "131000", 0],
["总裁管理", "131000", "131010", 0],
["总监管理", "131000", "131011", 0],
["财务总监(CFO)", "131000", "131012", 0],
["财务管理", "131000", "131013", 0],
["品牌管理", "131000", "131014", 0],
["项目管理", "131000", "131015", 0],
["生产管理", "131000", "131016", 0],
["经营管理", "131000", "131017", 0],
["采购管理", "131000", "131018", 0],
["文化管理", "131000", "131019", 0],
["供应链管理", "131000", "131020", 0],
["客户管理", "131000", "131021", 0],
["客户服务", "131000", "131022", 1],
["高级经理人", "131000", "131023", 0],
["人力资源", "131000", "131024", 0],
["拓展训练", "131000", "131025", 0],
["市场营销", "131000", "131026", 1],
["美容/护理/医学保健", "0", "140000", 0],
["美容/化妆/护理", "140000", "141000", 0],
["美容", "141000", "141010", 1],
["中医美容", "141000", "141011", 0],
["美发", "141000", "141012", 0],
["美甲", "141000", "141013", 0],
["美体", "141000", "141014", 0],
["化妆", "141000", "141015", 0],
["彩妆造型", "141000", "141016", 0],
["形象设计", "141000", "141017", 0],
["中医养生", "141000", "141018", 0],
["保健按摩", "141000", "141019", 0],
["按摩足疗", "141000", "141020", 0],
["针灸", "141000", "141021", 0],
["针灸推拿师", "141000", "141022", 0],
["纹绣", "141000", "141023", 0],
["影楼", "141000", "141024", 0],
["店面管理", "141000", "141025", 1],
["宠物美容护理", "141000", "141026", 0],
["医学保健", "140000", "141100", 0],
["健康管理师", "141100", "141110", 0],
["心理咨询师", "141100", "141111", 0],
["中医推拿师", "141100", "141112", 0],
["中医师", "141100", "141113", 0],
["心理保健师", "141100", "141114", 0],
["保健按摩师", "141100", "141115", 0],
["公共营养师", "141100", "141116", 0],
["康复理疗师", "141100", "141117", 0],
["芳疗师", "141100", "141118", 0],
["催乳师", "141100", "141119", 0],
["执业药师", "141100", "141120", 0],
["执业医师", "141100", "141121", 0],
["电钳工/服装/印刷", "0", "150000", 0],
["电工/钳工", "150000", "151000", 0],
["电工", "151000", "151010", 1],
["焊工", "151000", "151011", 0],
["高压电工", "151000", "151012", 0],
["电梯工", "151000", "151013", 0],
["钳工", "151000", "151014", 0],
["服装/模具/印刷", "150000", "151100", 0],
["服装设计", "151100", "151110", 1],
["服装裁剪", "151100", "151111", 0],
["服装打版", "151100", "151112", 0],
["服装营销", "151100", "151113", 0],
["数控机床", "151100", "151114", 0],
["模具设计", "151100", "151115", 0],
["PCB设计", "151100", "151116", 0],
["CTP印前工程师", "151100", "151117", 0],
["维修/驾驶", "0", "160000", 0],
["维修技能", "160000", "161000", 0],
["汽车维修", "161000", "161010", 1],
["汽车美容", "161000", "161011", 0],
["汽车音响改装", "161000", "161012", 0],
["机电维修", "161000", "161013", 0],
["制冷维修", "161000", "161014", 0],
["办公设备维修", "161000", "161015", 0],
["家电维修", "161000", "161016", 0],
["电脑维修", "161000", "161017", 0],
["手机维修", "161000", "161018", 0],
["驾驶技能", "160000", "161100", 0],
["叉车", "161100", "161110", 1],
["吊车", "161100", "161111", 0],
["拖车", "161100", "161112", 0],
["铲车", "161100", "161113", 0],
["挖掘机", "161100", "161114", 0],
["装载机", "161100", "161115", 0],
["船舶驾驶", "161100", "161116", 0],
["烹饪/餐饮", "0", "170000", 0],
["烹饪/餐饮", "170000", "171000", 0],
["厨师", "171000", "171010", 1],
["西餐", "171000", "171011", 0],
["料理", "171000", "171012", 0],
["烧腊卤水", "171000", "171013", 0],
["面点师", "171000", "171014", 1],
["糖水小吃", "171000", "171015", 0],
["寿司", "171000", "171016", 0],
["调酒师", "171000", "171017", 0],
["品酒师", "171000", "171018", 0],
["咖啡师", "171000", "171019", 0],
["茶艺师", "171000", "171020", 0],
["烹饪酒店管理", "171000", "171021", 0],
["其他", "0", "180000", 0],
["其他", "180000", "181000", 0],
["模特", "181000", "181010", 1],
["礼仪", "181000", "181011", 1],
["演艺", "181000", "181012", 0],
["播音主持", "181000", "181013", 0],
["DJ音控", "181000", "181014", 0],
["PLC设计", "181000", "181015", 0],
["摄影", "181000", "181016", 0],
["心理学/NLP", "181000", "181017", 0],
["眼镜验光", "181000", "181018", 0],
["窗帘布艺", "181000", "181019", 0],
["插花", "181000", "181020", 0],
["风水八字", "181000", "181021", 0],

];


function GetPosition(id) {
    for (var i = 0; i < jobArray.length; i++) {
        if (jobArray[i][2] == id) {
            return jobArray[i];
            break;
        }
    }
    return null;
}

function GetPositions(pid) {
    var positions = new Array();
    for (var i = 0; i < jobArray.length; i++) {
        if (jobArray[i][1] == pid) {
            positions.push(jobArray[i]);
        }
    }
    return positions;
}

function GetTopPositions() {
    var positions = new Array();
    for (var i = 0; i < jobArray.length; i++) {
        if (jobArray[i][1] == "0") {
            positions.push(jobArray[i]);
        }
    }
    return positions;
}

function GetPositionsByIds(ids, containBig) {
    var positions = new Array();
    for (var i = 0; i < jobArray.length; i++) {
        var pt = new RegExp(jobArray[i][2]);
        if ((containBig || jobArray[i][1] != "0") && pt.test(ids)) {
            positions.push(jobArray[i]);
        }
    }
    return positions;
}

function GetPositionsByKeywords(keyword, containBig, containMid) {
    var positions = new Array();
    var containBig = containBig || false;
    var containMid = containMid || false;
	var regular = new RegExp(keyword,'i');
    for (var i = 0; i < jobArray.length; i++) {
        //if (jobArray[i][0].indexOf(keyword) >= 0) {
        if (jobArray[i][0].match(regular)) {
            if (!containBig && jobArray[i][1] == "0") continue;
            if (!containMid && jobArray[i][2].substr(4,2) == "00") continue;
            positions.push(jobArray[i]);
        }
    }
    return positions;
}
function GetPositionsSuggest(keywd, containBig, containMid) {
    var poss = GetPositionsByKeywords(keywd, containBig, containMid);
    var str = "["
    for (var i = 0; i < poss.length; i++) {
        str += (str == "[" ? "" : ",") + "{t:'" + poss[i][0] + "',v:'" + poss[i][2] + "'}";
    }
    return str + "]";
}

function CreatePositionSelector(option) {
    //option {positionIds,lsPos1,lsPos2,lsPos3,titleProv,titleCity,titlePosition,value,afterchange}
    var _this = this;
    if (option == null) return;
    var sl1 = option.lsPos1;
    var sl2 = option.lsPos2;
    var sl3 = option.lsPos3;
    var positionIds = option.positionIds;
    if (typeof (sl1) == "string") sl1 = document.getElementById(sl1);
    if (typeof (sl2) == "string") sl2 = document.getElementById(sl2);
    if (typeof (sl3) == "string") sl3 = document.getElementById(sl3);
    var _positionsArray = null;
    var _isContainPosition = function (id) {
        if (_positionsArray == null) return false;
        for (var i = 0; i < _positionsArray.length; i++) if (_positionsArray[i][2] == id) return true;
        return false;
    }
    if (positionIds) {
        while (positionIds.indexOf("'") >= 0) positionIds = positionIds.replace("'", "");
        var ids = positionIds.split(',');
        for (var i = 0; i < ids.length; i++) {
            if (ids[i].length <= 1 || _isContainPosition(ids[i])) continue;
            var aPosition = GetPosition(ids[i]);
            if (!(aPosition && aPosition.push && aPosition.pop)) continue;
            if (_positionsArray == null) _positionsArray = new Array();
            _positionsArray.push(aPosition);

            //子对象
            if (ids[i].substr(4, 2) == "00") {
                var childs = GetPositions(ids[i]);
                for (var j = 0; j < childs.length; j++) {
                    if (_isContainPosition(childs[j][2])) continue;
                    _positionsArray.push(childs[j]);
                    if (ids[i].substr(4, 2) == "00") {
                        var childs2 = GetPositions(childs[j][2]);
                        for (var k = 0; k < childs2.length; k++) {
                            if (_isContainPosition(childs2[k][2])) continue;
                            _positionsArray.push(childs2[k]);
                        }
                    }
                }
            }

            if (aPosition[1].length <= 1 || _isContainPosition(aPosition[1])) continue;
            aPosition = GetPosition(aPosition[1]);
            if (!(aPosition && aPosition.push && aPosition.pop)) continue;
            _positionsArray.push(aPosition);

            if (aPosition[1].length <= 1 || _isContainPosition(aPosition[1])) continue;
            aPosition = GetPosition(aPosition[1]);
            if (!(aPosition && aPosition.push && aPosition.pop)) continue;
            _positionsArray.push(aPosition);
        }
    }
    //alert(JB.objToStr(_positionsArray));
    if (_positionsArray == null) _positionsArray = jobArray; //全局对象
    var _getPositions = function (id) {
        var positions = new Array();
        for (var i = 0; i < _positionsArray.length; i++) {
            if (_positionsArray[i][1] == id) {
                positions.push(_positionsArray[i]);
            }
        }
        return positions;
    }
    var _relateChanged = function (slA_value, slB, title) {
        var arr = _getPositions(slA_value);
        slB.length = 0;
        if (title) slB.options[0] = new Option(title, "");
        var selected = false;
        for (var i = 0; i < arr.length; i++) {
            slB.options[slB.length] = new Option(arr[i][0], arr[i][2]);
            if (option.value &&
                (arr[i][2] == option.value
                    || (option.value.length >= 4 && arr[i][2].substr(4, 2) == "00" && arr[i][2].substr(0, 4) == option.value.substr(0, 4))
                    || (option.value.length >= 2 && arr[i][2].substr(2, 4) == "0000" && arr[i][2].substr(0, 2) == option.value.substr(0, 2))
                 )
                ) {
                slB.options[slB.length - 1].selected = true;
                selected = true;
            }
        }
        if (!selected && slB.options[0]) slB.options[0].selected = true;
    }
    this.valueChanged = function () {
        var v = (sl3 && sl3.value != "") ? sl3.value : (sl2 && sl2.value != "") ? sl2.value : (sl1 && sl1.value) ? sl1.value : "";
        if (option.afterchange) option.afterchange(v);
    }
    this.cityChanged = function (e, vv) {
        if (sl3) { _relateChanged(vv || sl2.value, sl3, option.titlePosition); }
        _this.valueChanged();
    }
    this.proviceChanged = function (e, vv) {
        if (sl2) { _relateChanged(vv || sl1.value, sl2, option.titleCity); _this.cityChanged(); }
        else _this.valueChanged();
    }
    if (sl1) {
        _relateChanged("0", sl1, option.titleProv);
        _this.proviceChanged();
    } else if (sl2) {
        if (!option.value || option.value.length < 2 || option.value.substr(0, 2) == "00") { alert("区域初始信息错误"); return; }
        _this.proviceChanged(null, option.value.substr(0, 2) + "0000");
    } else if (sl3) {
        if (!option.value || option.value.length < 4 || option.value.substr(2, 2) == "00") { alert("区域初始信息错误"); return; }
        _this.cityChanged(null, option.value.substr(0, 4) + "00");
    }
    if (sl1) JB.attach(sl1, "change", _this.proviceChanged);
    if (sl2) JB.attach(sl2, "change", _this.cityChanged);
    if (sl3) JB.attach(sl3, "change", _this.valueChanged);
}





